<template>
    <div
        class="bg-[#ffbf00a3] border-[2px] border-[#ffbf00] rounded-xl p-4 flex items-center gap-4 absolute right-8 bottom-8" fade-r>
        <svg
            t="1722712139904"
            class="icon"
            viewBox="0 0 1024 1024"
            version="1.1"
            xmlns="http://www.w3.org/2000/svg"
            p-id="4256"
            width="60"
            height="60">
            <path
                d="M511.999 95.003c-230.524 0-418.076 187.552-418.075 418.077 0 230.527 187.552 418.077 418.075 418.077s418.077-187.55 418.077-418.077c0-230.525-187.552-418.077-418.077-418.077zM512 722.12c-28.86 0-52.26-23.399-52.26-52.263 0-28.858 23.399-52.257 52.26-52.257s52.26 23.399 52.26 52.257c0 28.863-23.399 52.263-52.26 52.263zM564.26 513.078c0 28.86-23.399 52.26-52.26 52.26s-52.26-23.399-52.26-52.26v-156.775c0-28.86 23.399-52.26 52.26-52.26s52.26 23.399 52.26 52.26v156.775z"></path>
        </svg>
        <div>
            <h2 class="text-3xl">警告！</h2>
            <span class="text-2xl">此页面还未开发完毕，不代表最终效果</span>
        </div>
    </div>
</template>
